## Steps in this notebook Task 4.9

- Part 1 

- Step 3: importing dataframe
- Step 4: Wrangling dataframe
- Step 5: chekcing for consistency
- Step 6: merging dataframes
- Step 8: exporting final dataframe

In [7]:
# Importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# PART 1

## Step 3. Importing Dataframes

In [8]:
# Creating path
path =r'/Users/parvinrahimi/Desktop/Data/Data Immersion/Achievement 4/TASK 3/06-2023 Instacart Basket Analysis 9.46.07 AM'

In [9]:
# Importing dataframes
df_customer = pd.read_csv(os.path.join(path, '01 Project Management', 'Original Data','customers.csv'))

## Step 4. Wrangling the Dataframe

In [10]:
df_customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
# describe dataframe
df_customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

#### Dataframe seems to be consistent

In [12]:
# datatypes of dataframe
df_customer.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [13]:
# number of rows and columns
df_customer.shape

(206209, 10)

In [14]:
#renaming column n_dependants
df_customer.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)

In [15]:
#renaming column surnam
df_customer.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [16]:
#renaming column First Name
df_customer.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [17]:
#renaming column Gender
df_customer.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [18]:
#renaming column STATE
df_customer.rename(columns = {'STATE' : 'state'}, inplace = True)

In [19]:
#renaming column Age
df_customer.rename(columns = {'Age' : 'age'}, inplace = True)

In [20]:
df_customer.head()

,user_id,first_name,surname,gender,state,age,date_joined,number_of_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [21]:
# dropping columns 
df_customer_dropped = df_customer.drop (columns = ['number_of_dependants'])

In [22]:
df_customer_dropped.head()

,user_id,first_name,surname,gender,state,age,date_joined,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,married,40374

In [23]:
# changing the type of column user_id to string
df_customer_dropped['user_id'] = df_customer_dropped['user_id'].astype('str')

In [24]:
#check if the data was changed
df_customer_dropped['user_id'].dtype

dtype('O')

## Step 5. checking the Consistency: (also see above)

In [25]:
# Check if dataframe contains mixed type columns
for col in df_customer_dropped.columns.tolist():
  weird = (df_customer_dropped[[col]].applymap(type) != df_customer_dropped[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer_dropped[weird]) > 0:
    print (col)

first_name

In [26]:
# changing mixed datatype (First Name) to string
df_customer_dropped['first_name'] = df_customer_dropped['first_name'].astype('str')

In [27]:
# check if the data was changed
df_customer_dropped['first_name'].dtype

dtype('O')

In [28]:
# Finding missing values
df_customer_dropped.isnull().sum()

user_id        0
first_name     0
surname        0
gender         0
state          0
age            0
date_joined    0
fam_status     0
income         0
dtype: int64

In [29]:
# finding exact missing values
df_cust_missing = df_customer_dropped[df_customer_dropped['first_name'].isnull()==True]

In [30]:
df_cust_missing

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, fam_status, income]
Index: []

### There are no missing data.

In [31]:
# looking for full duplicates
df_customer_dups = df_customer_dropped[df_customer_dropped.duplicated()]

In [32]:
df_customer_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, fam_status, income]
Index: []

### There are no duplicates.

## Exporting Dataframe

In [33]:
# exporting as pkl
df_customer_dropped.to_pickle(os.path.join(path, '01 Project Management', 'Prepared Data', 'customer_clean.pkl'))

## Step 6. Merging Dataframes

In [34]:
# Importing dataframe customers_clean
df_1 = pd.read_pickle(os.path.join(path, '01 Project Management', 'prepared Data','customer_clean.pkl'))

In [35]:
# Importing dataframe aggregated_data
df_2 = pd.read_pickle(os.path.join(path, '01 Project Management', 'prepared Data','aggregated_data.pkl'))

In [36]:
# ckecking the dataframes
df_1.head()

,user_id,first_name,surname,gender,state,age,date_joined,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,married,40374

In [37]:
df_2.head()

,Unnamed: 0_x,Row_Number,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,last_order_in_days,product_id,...,price_range_loc,busiest_day,Busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_days_last_order,order_frequency_flag
0,0,0,2539329,1,prior,1,2,8,NaN,196,...,Mid_range product,Regularly busy,Regularly busy,Average_orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,1,1,2398795,1,prior,2,3,7,15.0,196,...,Mid_range product,Regularly busy,Least busiest days,Fewest_orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,2,2,473747,1,prior,3,3,12,21.0,196,...,Mid_range product,Regularly busy,Least busiest days,Most_orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,3,3,2254736,1,prior,4,4,7,29.0,196,...,Mid_range product,Least busy,Least busiest days,Fewest_orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,4,4,431534,1,prior,5,4,15,28.0,196,...,Mid_range product,Least busy,Least busiest days,Most_orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [38]:
# checking the size of both dataframes
df_1.shape

(206209, 9)

In [39]:
df_2.shape

(32404859, 28)

In [40]:
# dropping unnecessary columns df_2
df_2_dropped = df_2.drop (columns = ['Unnamed: 0_x', 'Unnamed: 0_y', 'Row_Number', 'eval_set', '_merge'])

### we can join both dataframes using the common column: user_id

In [41]:
# datatypes of dataframe
df_2_dropped.dtypes

order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
last_order_in_days        float64
product_id                  int64
add_to_cart_order           int64
reordered                   int64
product_name               object
aisle_id                    int64
department_id               int64
prices                    float64
price_range_loc            object
busiest_day                object
Busiest_days               object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
average_price             float64
spending_flag              object
median_days_last_order    float64
order_frequency_flag       object
dtype: object

In [42]:
# changing the type of column user_id to string for consistency reasons to merge
df_2_dropped['user_id'] = df_2_dropped['user_id'].astype('str')

In [43]:
#check if the data was changed
df_2_dropped['user_id'].dtype

dtype('O')

In [44]:
# inner joing dataframes
final_merged = df_1.merge(df_2_dropped, on = 'user_id', indicator = True)

In [45]:
final_merged.head()

,user_id,first_name,surname,gender,state,age,date_joined,fam_status,income,order_id,...,busiest_day,Busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_days_last_order,order_frequency_flag,_merge
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,married,165665,2543867,...,Regularly busy,Busiest days,Most_orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,married,165665,1285508,...,Regularly busy,Regularly busy,Most_orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,married,165665,2578584,...,Regularly busy,Busiest days,Most_orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,married,165665,423547,...,Regularly busy,Regularly busy,Most_orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,married,165665,2524893,...,Regularly busy,Least busiest days,Most_orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both

In [48]:
# Test merge
final_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [49]:
# dropping unnecessary columns
merged_data = final_merged.drop (columns = ['_merge'])

## Step 8: Exporting final dataframe

In [51]:
# exporting as pkl
merged_data.to_pickle(os.path.join(path, '01 Project Management', 'Prepared Data', 'merged_last_4.9.pkl'))